Autodesk.Navisworks.Api.Plugins.CommandState
Represents the state of a command in the GUI

Autodesk.Navisworks.Api.Plugins.CommandState.#ctor
Constructor

Autodesk.Navisworks.Api.Plugins.CommandState.#ctor(System.Boolean)
Constructor
enabled:
Allows specifiecation of Enabled

Autodesk.Navisworks.Api.Plugins.CommandState.IsChecked
Specifies if the command should be checked

Autodesk.Navisworks.Api.Plugins.CommandState.IsEnabled
Specifies if the command should be enabled

Autodesk.Navisworks.Api.Plugins.CommandState.IsVisible
Specifies if the command should be visible

Autodesk.Navisworks.Api.Plugins.CommandState.OverrideDisplayName
Specifies if the display name for the command should be overridden